<script setup>
import { defineAsyncComponent, ref, onMounted } from "vue";
import { emitter } from "@/utils/mitt.js";

onMounted(() => {
  emitter.on("render-component", (index) => {
    //   更改要渲染哪个组件的索引
    currentIndex.value = index;
  });
});
/**
 * 是否为扫码登录
 *  true:扫码登录 false账号登录
 */
const isScanCodeLogin = ref(false);
//切换 扫码登录
const switchToScanCodeLogin = (index) => {
  isScanCodeLogin.value = !isScanCodeLogin.value;
  currentIndex.value = index;
};

//渲染哪个组件的索引
const currentIndex = ref(0);
//要渲染的组件
const renderComponents = [
  {
    title: "账号密码登录",
    component: defineAsyncComponent(() => import("./AccountLoginForm.vue")),
  },
  {
    title: "验证码登录",
    component: defineAsyncComponent(() => import("./CaptchaLoginForm.vue")),
  },
  {
    title: "扫码登录",
    component: defineAsyncComponent(() => import("./ScanCodePanel.vue")),
  },
];
</script>

<template>
  <div class="mod-box">
    <div class="login-wrap">
      <div class="login-box">
        <keep-alive>
          <component :is="renderComponents[currentIndex].component"></component>
        </keep-alive>
      </div>
      <div class="login-code">
        <template v-if="isScanCodeLogin">
          <a href="javascript:void(0)" @click="switchToScanCodeLogin(0)">
            账号登录
            <svg
              t="1714791938527"
              class="icon-computer"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="7847"
              width="16"
              height="16"
            >
              <path
                d="M554.666667 682.666667v85.333333h128v42.666667H384v-42.666667h128v-85.333333H170.666667V213.333333h725.333333v469.333334h-341.333333z m0-42.666667h298.666666V256H213.333333v384h341.333334z"
                fill="#ffffff"
                p-id="7848"
              ></path>
            </svg>
          </a>
        </template>
        <template v-else>
          <a href="javascript:void(0)" @click="switchToScanCodeLogin(2)">
            扫码登录
            <svg
              t="1714790786603"
              class="icon-qrcode"
              viewBox="0 0 1024 1024"
              version="1.1"
              xmlns="http://www.w3.org/2000/svg"
              p-id="4363"
              width="13"
              height="13"
            >
              <path
                d="M201.274096 209.080899 267.600711 209.080899 267.600711 275.407514 201.274096 275.407514 201.274096 209.080899Z"
                fill="#ffffff"
                p-id="4364"
              ></path>
              <path
                d="M386.990868 89.692788 81.885985 89.692788l0 305.105906 119.388111 0 0 53.061496 66.326615 0 0-53.061496 119.389134 0 0-66.328661 53.061496 0 0-53.06252-53.061496 0L386.989845 89.692788 386.990868 89.692788 386.990868 89.692788zM320.66323 328.470033 148.2126 328.470033 148.2126 156.019403l172.45063 0L320.66323 328.470033 320.66323 328.470033z"
                fill="#ffffff"
                p-id="4365"
              ></path>
              <path
                d="M201.274096 752.963027 267.600711 752.963027 267.600711 819.290665 201.274096 819.290665 201.274096 752.963027Z"
                fill="#ffffff"
                p-id="4366"
              ></path>
              <path
                d="M745.156224 209.080899 811.483862 209.080899 811.483862 275.407514 745.156224 275.407514 745.156224 209.080899Z"
                fill="#ffffff"
                p-id="4367"
              ></path>
              <path
                d="M506.378979 508.837984 506.378979 580.51342 572.706617 580.51342 572.706617 514.185782 625.76709 514.185782 625.76709 447.859167 572.706617 447.859167 572.706617 394.798694 506.378979 394.798694 506.378979 448.195835 506.378979 508.837984Z"
                fill="#ffffff"
                p-id="4368"
              ></path>
              <path
                d="M506.378979 751.404532 506.378979 819.291688 572.706617 819.291688 572.706617 751.404532 572.706617 699.901531 625.76709 699.901531 625.76709 633.573893 570.660005 633.573893 506.378979 633.573893 506.378979 690.762383 506.378979 751.404532Z"
                fill="#ffffff"
                p-id="4369"
              ></path>
              <path
                d="M572.706617 819.291688 625.76709 819.291688 625.76709 872.352161 572.706617 872.352161 572.706617 819.291688Z"
                fill="#ffffff"
                p-id="4370"
              ></path>
              <path
                d="M440.052364 872.352161 440.052364 938.679799 510.017856 938.679799 572.706617 938.679799 572.706617 872.352161 510.017856 872.352161 440.052364 872.352161Z"
                fill="#ffffff"
                p-id="4371"
              ></path>
              <path
                d="M692.094728 699.901531 625.76709 699.901531 625.76709 751.404532 625.76709 819.291688 691.942255 819.291688 745.156224 819.291688 745.156224 752.963027 692.094728 752.963027 692.094728 699.901531Z"
                fill="#ffffff"
                p-id="4372"
              ></path>
              <path
                d="M745.156224 938.679799 813.227576 938.679799 873.868701 938.679799 930.872996 938.679799 930.872996 872.352161 873.868701 872.352161 811.484885 872.352161 811.484885 819.291688 745.156224 819.291688 745.156224 872.688829 745.156224 938.679799Z"
                fill="#ffffff"
                p-id="4373"
              ></path>
              <path
                d="M930.872996 514.185782 930.872996 447.859167 873.868701 447.859167 811.484885 447.859167 811.484885 514.185782 873.868701 514.185782 930.872996 514.185782Z"
                fill="#ffffff"
                p-id="4374"
              ></path>
              <path
                d="M864.545358 752.963027 930.872996 752.963027 930.872996 819.290665 864.545358 819.290665 864.545358 752.963027Z"
                fill="#ffffff"
                p-id="4375"
              ></path>
              <path
                d="M440.052364 328.470033 506.378979 328.470033 506.378979 394.796648 440.052364 394.796648 440.052364 328.470033Z"
                fill="#ffffff"
                p-id="4376"
              ></path>
              <path
                d="M745.156224 447.859167l0-53.061496 185.715749 0L930.871973 89.692788 625.76709 89.692788l0 66.326615-55.107085 0-64.281025 0 0 53.061496 64.281025 0 55.108109 0 0 66.326615-53.06252 0 0 53.06252 53.06252 0 0 66.326615 66.325591 0 0 53.061496 53.06252 0L745.156224 447.859167 745.156224 447.859167zM692.094728 156.019403 864.544335 156.019403l0 172.45063L692.094728 328.470033 692.094728 156.019403 692.094728 156.019403z"
                fill="#ffffff"
                p-id="4377"
              ></path>
              <path
                d="M692.094728 580.51342 745.156224 580.51342 745.156224 633.573893 692.094728 633.573893 692.094728 580.51342Z"
                fill="#ffffff"
                p-id="4378"
              ></path>
              <path
                d="M811.484885 699.901531 745.156224 699.901531 745.156224 752.963027 813.227576 752.963027 864.545358 752.963027 864.545358 690.762383 864.545358 633.573893 930.872996 633.573893 930.872996 580.51342 873.868701 580.51342 811.484885 580.51342 811.484885 630.121258 811.484885 699.901531Z"
                fill="#ffffff"
                p-id="4379"
              ></path>
              <path
                d="M440.052364 209.080899 506.378979 209.080899 506.378979 275.407514 440.052364 275.407514 440.052364 209.080899Z"
                fill="#ffffff"
                p-id="4380"
              ></path>
              <path
                d="M267.600711 514.185782 320.66323 514.185782 320.66323 580.51342 267.600711 580.51342 267.600711 514.185782Z"
                fill="#ffffff"
                p-id="4381"
              ></path>
              <path
                d="M440.052364 447.859167 388.733559 447.859167 320.66323 447.859167 320.66323 514.185782 386.990868 514.185782 386.990868 580.51342 440.052364 580.51342 440.052364 508.837984 440.052364 447.859167Z"
                fill="#ffffff"
                p-id="4382"
              ></path>
              <path
                d="M386.990868 819.291688 386.990868 699.901531l53.061496 0 0-66.326615-51.318806 0-187.459462 0 0-64.094784 0-55.293327-55.108109 0L81.885985 514.186805l0 66.326615 66.327638 0 0 53.061496L81.885985 633.574916l0 305.105906 305.105906 0 0-66.327638 53.061496 0 0-53.061496L386.990868 819.291688 386.990868 819.291688zM320.66323 872.352161 148.2126 872.352161 148.2126 699.901531l172.45063 0L320.66323 872.352161 320.66323 872.352161z"
                fill="#ffffff"
                p-id="4383"
              ></path>
              <path
                d="M440.052364 580.51342 506.378979 580.51342 506.378979 633.573893 440.052364 633.573893 440.052364 580.51342Z"
                fill="#ffffff"
                p-id="4384"
              ></path>
              <path
                d="M625.76709 514.185782 692.094728 514.185782 692.094728 580.51342 625.768113 580.51342 625.768113 514.185782 625.76709 514.185782Z"
                fill="#ffffff"
                p-id="4385"
              ></path>
              <path
                d="M745.156224 514.185782 811.483862 514.185782 811.483862 580.51342 745.156224 580.51342 745.156224 514.185782Z"
                fill="#ffffff"
                p-id="4386"
              ></path>
            </svg>
          </a>
        </template>
      </div>
    </div>
  </div>
</template>

<style scoped>
.mod-box {
  width: 980px;
  margin: 0 auto;
  z-index: 10;
  position: relative;
  display: flex;
  flex-direction: row;
  justify-content: end;
}
.login-wrap {
  margin-right: 72px;
  margin-top: 50px;
  width: 380px;
  min-height: 540px;
  position: relative;
}
.login-box {
  background-color: #ffffff;
  padding: 30px 30px 20px;
  border-radius: 4px;
  box-shadow: 0 1px 6px rgba(0, 0, 0, 0.1);
  min-height: 370px;
}
.login-box-title {
  padding-bottom: 16px;
  font-size: 18px;
  color: #111111;
  line-height: 1;
  font-family:
    PingFangSC-Medium,
    Microsoft YaHei,
    SimSun,
    Tahoma,
    Verdana,
    Arial,
    sans-serif;
}
.login-code {
  position: absolute;
  top: 10px;
  right: -32px;
  background-color: #3882e5;
  box-shadow: 0 1px 6px 0 rgba(0, 0, 0, 0.1);
  text-align: center;
  a {
    writing-mode: vertical-lr;
    font-size: 13px;
    color: #ffffff;
    line-height: 16px;
    padding: 9px;
    letter-spacing: 3px;
    display: block;
    width: 14px;
    height: 86px;
  }
  .icon-qrcode,
  .icon-computer {
    width: 13px;
    height: 13px;
    transform: translateY(-5px);
  }
}
</style>
